Embedfire-rtthread/ebf_rtthread_peripheral_code_stm32f407_jiaoyang/16-RT-Thread-CAN通信实验-回环测试/User/main.c
/**
  ******************************************************************************
  * @file    main.c
  * @author  fire
  * @version V1.0
  * @date    2020-xx-xx
  * @brief   GPIO输出--使用固件库点亮LED灯
  ******************************************************************************
  * @attention
  *
  * 实验平台:野火  STM32 F407 开发板 
  * 论坛    :http://www.firebbs.cn
  * 淘宝    :http://firestm32.taobao.com
  *
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "stm32f4xx.h"
#include "board_init.h"


/*
*************************************************************************
*                               变量
*************************************************************************
*/
/* 定义线程控制块 */
static rt_thread_t led1_thread = RT_NULL;
static rt_thread_t key_thread = RT_NULL;

/* 定义信号量控制块 */
rt_sem_t test_sem = RT_NULL;
/*
*************************************************************************
*                             函数声明
*************************************************************************
*/
static void led1_thread_entry(void* parameter);
static void key_thread_entry(void* parameter);

/*
*************************************************************************
*                             main 函数
*************************************************************************
*/
/**
  * @brief  主函数
  * @param  无
  * @retval 无
  */
int main(void)
{
    /* 
	 * 开发板硬件初始化，RTT系统初始化已经在main函数之前完成，
	 * 即在component.c文件中的rtthread_startup()函数中完成了。
	 * 所以在main函数中，只需要创建线程和启动线程即可。
	 */
	rt_kprintf("这是一个[野火]-STM32-RTT-CAN通信回环测试实验！\n");

	   /* 创建一个信号量 */
	test_sem = rt_sem_create("test_sem",/* 信号量名字 */
															 0,     /* 信号量初始值，默认有一个信号量 */
									 RT_IPC_FLAG_FIFO); /* 信号量模式 FIFO(0x00)*/
	
  if (test_sem != RT_NULL)
    rt_kprintf("信号量创建成功！\n\n");
	
	led1_thread =                          /* 线程控制块指针 */
    rt_thread_create( "led1",              /* 线程名字 */
                      led1_thread_entry,   /* 线程入口函数 */
                      RT_NULL,             /* 线程入口函数参数 */
                      512,                 /* 线程栈大小 */
                      3,                   /* 线程的优先级 */
                      20);                 /* 线程时间片 */
                   
    /* 启动线程，开启调度 */
   if (led1_thread != RT_NULL)
        rt_thread_startup(led1_thread);
    else
        return -1;

		key_thread =                          /* 线程控制块指针 */
    rt_thread_create( "key",              /* 线程名字 */
                      key_thread_entry,   /* 线程入口函数 */
                      RT_NULL,             /* 线程入口函数参数 */
                      512,                 /* 线程栈大小 */
                      2,                   /* 线程的优先级 */
                      20);                 /* 线程时间片 */
                   
    /* 启动线程，开启调度 */
   if (key_thread != RT_NULL)
        rt_thread_startup(key_thread);
    else
        return -1;
}

/*
*************************************************************************
*                             线程定义
*************************************************************************
*/

static void led1_thread_entry(void* parameter)
{	
	/* 初始化can,在中断接收CAN数据包 */
	CAN_Config();
	printf("\r\n 欢迎使用野火  STM32 F407 开发板。\r\n");
	printf("\r\n 野火F407 CAN通讯实验例程\r\n");

	printf("\r\n 实验步骤：\r\n");

	printf("\r\n 1.按下开发板的KEY1键，会使用CAN向外发送0-7的数据包，包的扩展ID为0x1314 \r\n");
	printf("\r\n 2.若开发板的CAN接收到扩展ID为0x1314的数据包，会把数据以打印到串口。 \r\n");
	printf("\r\n 3.本例中的can波特率为1MBps，为stm32的can最高速率。 \r\n");
	while (1)
	{
		rt_sem_take(test_sem,	/* 获取信号量 */
                RT_WAITING_FOREVER); 	/* 等待时间：一直等 */
		
		printf("\r\nCAN接收到数据：\r\n");	
		CAN_DEBUG_ARRAY(Rx_Buff,8); 			
	}
}

static void key_thread_entry(void* parameter)
{
	while (1)
	{
			if( Key_Scan(KEY1_GPIO_PORT, KEY1_PIN) != KEY_OFF)
			{
				uint32_t TxMailbox=0;
				LED1_ON;			
				/* 装载一帧数据 */
				CAN_SetMsg();
				/* 开始发送数据 */
				HAL_CAN_AddTxMessage(&Can_Handle,my_Packge.TxHeader,my_Packge.Payload,&TxMailbox);
				rt_thread_delay(100);
				LED3_ON;		
			}
			rt_thread_delay(10);   /* 延时10个tick */		 	
	}
}

/********************************END OF FILE****************************/
